# Pandasa Giris

## Pandas serisi olusturmak

In [1]:
import pandas as pd

In [3]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [5]:
seri = pd.Series([10,88,3,4,5])

In [6]:
seri

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [7]:
type(seri)

pandas.core.series.Series

In [8]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [9]:
seri.ndim

1

In [11]:
seri.dtype

dtype('int64')

In [12]:
seri.size

5

In [13]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [14]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [15]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [20]:
seri = pd.Series([10,88,3,4,5], index= ["a","b","c","d","e"])

In [21]:
seri ["a"]

10

In [22]:
seri["a":"c"]

a    10
b    88
c     3
dtype: int64

In [24]:
sozluk = { "reg":10 , "log":11 , "cart":12}

seri = pd.Series(sozluk)

In [26]:
seri

a    10
b    88
c     3
d     4
e     5
dtype: int64

In [27]:
pd.concat([seri,seri])

a    10
b    88
c     3
d     4
e     5
a    10
b    88
c     3
d     4
e     5
dtype: int64

In [4]:
import numpy as np
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [6]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [2]:
seri = pd.Series([121,200,150,99] , index =["reg","loj","cart","rf"])

In [3]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [10]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [11]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [12]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [13]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [14]:
"reg" in seri

True

In [15]:
seri["reg"]

121

In [16]:
seri[["rf", "reg"]] #fancy ile secimdir

rf      99
reg    121
dtype: int64

In [17]:
seri["rf"] = 136

In [18]:
seri["rf"]

136

In [19]:
seri

reg     121
loj     200
cart    150
rf      136
dtype: int64

In [21]:
seri["reg":"loj"]

reg    121
loj    200
dtype: int64

## Pandas dataframe olusturma

In [5]:
import pandas as pd

In [6]:
l = [1,2,39,67,90]

In [7]:
pd.DataFrame(l , columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [26]:
import numpy as np

In [27]:
m = np.arange(1,10).reshape(3,3)

In [31]:
df = pd.DataFrame(m , columns = ["var1", "var2" , "var3"])

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.columns = ("deg1" , "deg2" , "deg3")

In [34]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [35]:
df.head(2)

   deg1  deg2  deg3
0     1     2     3
1     4     5     6

In [36]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [37]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [41]:
type(df.values)

numpy.ndarray

In [42]:
df.ndim

2

In [43]:
df.shape

(3, 3)

In [44]:
df.size

9

## eleman islemleri

In [45]:
import numpy as np

In [47]:
s1= np.random.randint(10, size = 5)
s2= np.random.randint(10, size = 5)
s3= np.random.randint(10, size = 5)

In [48]:
sozluk = {"var1": s1,
         "var2":s2,
         "var3":s3}

In [49]:
sozluk

{'var1': array([5, 1, 3, 4, 4]),
 'var2': array([5, 7, 1, 6, 5]),
 'var3': array([5, 6, 4, 1, 8])}

In [50]:
df = pd.DataFrame(sozluk)

In [51]:
df

   var1  var2  var3
0     5     5     5
1     1     7     6
2     3     1     4
3     4     6     1
4     4     5     8

In [52]:
df[0:1] #basit index

   var1  var2  var3
0     5     5     5

In [53]:
df.index = ["a","b","c","d","e"]

In [54]:
df

   var1  var2  var3
a     5     5     5
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [55]:
df["c":"e"] #slicing

   var1  var2  var3
c     3     1     4
d     4     6     1
e     4     5     8

In [56]:
#SİLME İSLEMİ

In [57]:
df.drop("a",axis=0) #kalıcı silmez

   var1  var2  var3
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [58]:
df

   var1  var2  var3
a     5     5     5
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [59]:
df.drop("a",axis=0 , inplace = True) #kalıcı olarak sildi

In [60]:
df

   var1  var2  var3
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [61]:
l= ["c", "e"] #fancy ile silme

In [62]:
df.drop(l,axis=0)

   var1  var2  var3
b     1     7     6
d     4     6     1

In [63]:
#degiskenler icin

In [65]:
l = "var1" , "var4"
for i in l:
    print(i in df)

True
False

In [66]:
df["var1"]

b    1
c    3
d    4
e    4
Name: var1, dtype: int32

In [67]:
df

   var1  var2  var3
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [68]:
df["var4"] = df["var1"] / df["var2"]

In [70]:
df

   var1  var2  var3      var4
b     1     7     6  0.142857
c     3     1     4  3.000000
d     4     6     1  0.666667
e     4     5     8  0.800000

In [71]:
df.drop("var4" , axis=1) #kalıcı silmedi

   var1  var2  var3
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [72]:
df

   var1  var2  var3      var4
b     1     7     6  0.142857
c     3     1     4  3.000000
d     4     6     1  0.666667
e     4     5     8  0.800000

In [73]:
df.drop("var4" , axis=1 , inplace=True) #kalıcı sildi

In [74]:
df

   var1  var2  var3
b     1     7     6
c     3     1     4
d     4     6     1
e     4     5     8

In [75]:
l = ["var1" , "var2"] #fancy ile silme

In [76]:
df.drop(l, axis=1)

   var3
b     6
c     4
d     1
e     8

## LOC İLOC

In [10]:
import numpy as np
import pandas as pd
a = np.random.randint(1, 30 , size= (10,3))
df = pd.DataFrame(a , columns = ["var1", "var2" , "var3"])

In [11]:
df

   var1  var2  var3
0     7    28     2
1     7    10    13
2    26    11     5
3     7     8    18
4     4    14    28
5    17    11    29
6    11     5    14
7    12     3    29
8     8     3    27
9    28    27     7

In [85]:
df.loc[0:3] #yazıldıgı gıbı alır

   var1  var2  var3
0     6    15     8
1     1     5    24
2    18     6    26
3    18     7    24

In [86]:
df.iloc[0:3] #klasik indeskleme gibi alır

   var1  var2  var3
0     6    15     8
1     1     5    24
2    18     6    26

In [87]:
df.iloc[:3,:2]

   var1  var2
0     6    15
1     1     5
2    18     6

In [89]:
df.iloc[:3,1:2]

   var2
0    15
1     5
2     6

In [90]:
df.loc[0:3, "var3"]

0     8
1    24
2    26
3    24
Name: var3, dtype: int32

In [91]:
df.iloc[0:3]["var3"]

0     8
1    24
2    26
Name: var3, dtype: int32

In [92]:
df["var1"]

0     6
1     1
2    18
3    18
4    21
5     2
6    28
7    23
8    19
9    29
Name: var1, dtype: int32

In [93]:
df["var1"][0:1]

0    6
Name: var1, dtype: int32

In [97]:
df[0:2]["var1"]

0    6
1    1
Name: var1, dtype: int32

In [99]:
df[0:2][["var1" , "var2"]] #fancy ile secim cift parantez

   var1  var2
0     6    15
1     1     5

In [20]:
df.var1

0     7
1     7
2    26
3     7
4     4
5    17
6    11
7    12
8     8
9    28
Name: var1, dtype: int32

In [19]:
df[df.var1<29]

   var1  var2  var3
0     7    28     2
1     7    10    13
2    26    11     5
3     7     8    18
4     4    14    28
5    17    11    29
6    11     5    14
7    12     3    29
8     8     3    27
9    28    27     7

In [21]:
df[(df.mag>39) & (df.mag<41)]

   var1  var2  var3
5    17    11    29
6    11     5    14
7    12     3    29
8     8     3    27

In [106]:
df[(df.var1>15) & (df.var3<12)]

   var1  var2  var3
6    28    19     6
7    23    17     4
9    29    20     9

In [108]:
df.loc[(df.var1>15) , ["var1", "var2"]] #loc koymazsan calısmaz

   var1  var2
2    18     6
3    18     7
4    21    11
6    28    19
7    23    17
8    19    12
9    29    20

In [15]:
df[df.var1>15][["var1", "var2"]]

   var1  var2
2    26    11
5    17    11
9    28    27

## birlestirme JOIN

In [114]:
import numpy as np
import pandas as pd
m = np.random.randint(1, 30 , size= (5,3))
df1 = pd.DataFrame(m , columns = ["var1", "var2" , "var3"])
df1

   var1  var2  var3
0    27     3    19
1    13    29    26
2     1     6    10
3    25    24     6
4     6    11    19

In [116]:
df2= df1 + 99

In [117]:
df2

   var1  var2  var3
0   126   102   118
1   112   128   125
2   100   105   109
3   124   123   105
4   105   110   118

In [119]:
pd.concat([df1,df2])

   var1  var2  var3
0    27     3    19
1    13    29    26
2     1     6    10
3    25    24     6
4     6    11    19
0   126   102   118
1   112   128   125
2   100   105   109
3   124   123   105
4   105   110   118

In [121]:
pd.concat([df1,df2] , ignore_index = True)

   var1  var2  var3
0    27     3    19
1    13    29    26
2     1     6    10
3    25    24     6
4     6    11    19
5   126   102   118
6   112   128   125
7   100   105   109
8   124   123   105
9   105   110   118

In [123]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [125]:
df2.columns = ["var1", "var2" ,"deg3"]

In [126]:
df2

   var1  var2  deg3
0   126   102   118
1   112   128   125
2   100   105   109
3   124   123   105
4   105   110   118

In [128]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    27     3  19.0    NaN
1    13    29  26.0    NaN
2     1     6  10.0    NaN
3    25    24   6.0    NaN
4     6    11  19.0    NaN
0   126   102   NaN  118.0
1   112   128   NaN  125.0
2   100   105   NaN  109.0
3   124   123   NaN  105.0
4   105   110   NaN  118.0

In [129]:
pd.concat([df1,df2] , join ="inner")

   var1  var2
0    27     3
1    13    29
2     1     6
3    25    24
4     6    11
0   126   102
1   112   128
2   100   105
3   124   123
4   105   110

## merge

## Gruplama ve Toplulaştırma (Grouping & Aggregation )

In [1]:
import seaborn as sns

In [138]:
df = sns.load_dataset("planets")

In [139]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [140]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [141]:
df.shape

(1035, 6)

In [142]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [143]:
df["mass"].mean()

2.6381605847953233

In [144]:
df["mass"].min()

0.0036

In [146]:
df["mass"].max()

25.0

In [147]:
df["mass"].sum()

1353.37638

In [148]:
df["mass"].std()

3.8186166509616046

In [151]:
df["mass"].var()

14.58183312700122

In [156]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [158]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [159]:
df["mass"].count()

513

## Gruplama İşlemleri

In [6]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                   "veri" : [10,56,84,71,23,24] } , columns = ["gruplar" ,"veri"])

In [7]:
df

  gruplar  veri
0       A    10
1       B    56
2       C    84
3       A    71
4       B    23
5       C    24

In [165]:
df.groupby("gruplar")

In [8]:
df.groupby("gruplar").mean()

         veri
gruplar
A        40.5
B        39.5
C        54.0

In [167]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [168]:
df.groupby("method")

In [169]:
df.groupby("method")["orbital_period"]

In [170]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [171]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [172]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## Aggregate

In [62]:
import pandas as pd
import seaborn as sns
import numpy as np

In [61]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                   "degisken1" : [10,56,84,71,23,24] , "degisken2" : [110,556,874,741,263,254]} ,
                  columns = ["gruplar" ,"degisken1" , "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        110
1       B         56        556
2       C         84        874
3       A         71        741
4       B         23        263
5       C         24        254

In [14]:
df.groupby("gruplar")

In [16]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             40.5      425.5
B             39.5      409.5
C             54.0      564.0

In [63]:
df.groupby("gruplar").aggregate([min , np.median ,"max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   40.5  71       110  425.5  741
B              23   39.5  56       263  409.5  556
C              24   54.0  84       254  564.0  874

In [21]:
df.groupby("gruplar").aggregate({"degisken1":"min" , "degisken2": max})

         degisken1  degisken2
gruplar
A               10        741
B               23        556
C               24        874

## Filter

In [5]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                   "degisken1" : [10,56,84,71,23,24] , "degisken2" : [110,556,874,741,263,254]} ,
                  columns = ["gruplar" ,"degisken1" , "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        110
1       B         56        556
2       C         84        874
3       A         71        741
4       B         23        263
5       C         24        254

In [10]:
def filter_func(x):
    return x["degisken1"].std()>9

In [11]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10        110
1       B         56        556
2       C         84        874
3       A         71        741
4       B         23        263
5       C         24        254

In [9]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A        43.133514  446.184379
B        23.334524  207.182287
C        42.426407  438.406204

## Transform

In [12]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                   "degisken1" : [10,56,84,71,23,24] , "degisken2" : [110,556,874,741,263,254]} ,
                  columns = ["gruplar" ,"degisken1" , "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        110
1       B         56        556
2       C         84        874
3       A         71        741
4       B         23        263
5       C         24        254

In [13]:
df_a = df.iloc[:,1:3]

In [14]:
df_a

   degisken1  degisken2
0         10        110
1         56        556
2         84        874
3         71        741
4         23        263
5         24        254

In [17]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -1.159773  -1.170886
1   0.379156   0.294638
2   1.315896   1.339564
3   0.880981   0.902535
4  -0.724858  -0.668139
5  -0.691403  -0.697712

## Apply

In [18]:
df = pd.DataFrame({
                   "degisken1" : [10,56,84,71,23,24] , "degisken2" : [110,556,874,741,263,254]} ,
                  columns = ["degisken1" , "degisken2"])
df

   degisken1  degisken2
0         10        110
1         56        556
2         84        874
3         71        741
4         23        263
5         24        254

In [19]:
df.apply(np.mean)

degisken1     44.666667
degisken2    466.333333
dtype: float64

In [20]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                   "degisken1" : [10,56,84,71,23,24] , "degisken2" : [110,556,874,741,263,254]} ,
                  columns = ["gruplar" ,"degisken1" , "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        110
1       B         56        556
2       C         84        874
3       A         71        741
4       B         23        263
5       C         24        254

In [21]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         81        851
B            BB         79        819
C            CC        108       1128

## Pivot Tablolar

In [66]:
import seaborn as sns

In [23]:
titanic = sns.load_dataset("titanic")

In [24]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [26]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [27]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [29]:
titanic.pivot_table("survived" , index= "sex" , columns= "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [30]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [34]:
age = pd.cut(titanic["age"] , [0,18,90])

In [36]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [37]:
titanic.pivot_table("survived" , ["sex", age] , "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## DATA OKUMA

In [40]:
pd.read_csv("reading_data/ornekcsv.csv" , sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [46]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [47]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [48]:
df.columns =("a" , "b" , "c")

In [49]:
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [44]:
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [53]:
df = pd.read_csv("reading_data/data.txt")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [54]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [57]:
df.groupby("sex")[["size"]].mean()

            size
sex
Female  2.459770
Male    2.630573

In [58]:
import numpy as np
m = np.arange(1,7).reshape((3,2))
pd.DataFrame(m, columns = ["var1","var2"])

   var1  var2
0     1     2
1     3     4
2     5     6

In [59]:
df.groupby("gruplar").aggregate([min, np.median, max])

KeyError: 'gruplar'

In [68]:
seri = pd.Series([121,200,150,99])

seri.values

array([121, 200, 150,  99], dtype=int64)

In [ ]:
df[(df.mag>39) & (df.mag<41)]